{
  "10:30": [
    {
      "time": "2020-10-10 10:30",
      "title": "How to Kick Start Your Own Data Science Project - Hong Kong Real Estate?",
      "description": "This is a beginner level talk for those enthusiasts who are interested in data science and machine learning but have no idea how to kick start their own projects. In the talk, Yeung will use Hong Kong Real Estate as an example to show what kind of fundamental steps you will experience and complete in a data science project. The talk will cover from data scraping up to model deployment. If you have a specified topic want to start with but want some guidelines, you should not miss the talk!",
      "link": "#",
      "speaker": {
        "avatar": "https://www.gdghk.org/wp-content/uploads/2020/01/yeung_icon-1536x1536.jpg",
        "name": "Yeung Wong",
        "tag": "Machine Learning"
      }
   }
  ],
  "11:20": [
    {
      "time": "2020-10-10 11:20",
      "title": "Machine Learning topic TBC",
      "description": "",
      "link": "#",
      "speaker": {
        "avatar": "https://www.gdghk.org/wp-content/uploads/2020/06/kinni-2.png",
        "name": "Kinni Mew",
        "tag": "Machine Learning"
      }
   }
  ],
  "12:00": [
    {
      "time": "2020-10-10 12:00",
      "title": "DSC HKUST: Standing on Giants Shoulders Instead of Doing from Scratch (Tensorflow Hub Introduction)",
      "description": "The development of Deep Learning (DL) is growing fast.  Github contains a massive amount of DL Models.    If you try to utilize those models before, you may face some environment setup, configuration problem, model quality problem, etc.  The talk is going to introduce Tensorflow Hub: Tensorflow Hub Introduction, how to reuse the pre-trained model easily, how to retrain the model for other tasks.",
      "link": "#",
      "speaker": {
        "avatar": "",
        "name": "DSC HKUST - Arthur Yau",
        "tag": "Machine Learning"
      }
   }
  ],
  "12:40": [
    {
      "time": "2020-10-10 12:40",
      "title": "DSC HKUST: Building Blockchain Application with Solidity and Flutter",
      "description": "Blockchain technology is becoming more popular nowadays. In this session, you will be introduced the concepts of blockchain, smart contract, as well as using Solidity and Ethereum to build a simple blockchain app.",
      "link": "#",
      "speaker": {
        "avatar": "https://drive.google.com/file/d/1v-NM0V_aJv6qHe9MdH3uBGn9wLIGNEEK/view?usp=sharing",
        "name": "Thomas Chong",
        "tag": "Mobile"
      }
   }
  ],
  "14:00": [
    {
      "time": "2020-10-10 14:00",
      "title": "DSC CityU: How to automate your backend schema with typescript classes",
      "description": "Backend and Frontend developers now have amazing tools up their sleeves, ie. GraphQL SQL/No-SQL database, Firebase, etc, but there are always problems with communication for projects of teams, a distinct coding style might be difficult for managing states and resolving identical results in the different codebase. I hope to provide an alternative solution through this talk, where users worry less about implementation and more on software design.\n- A problem with backend and frontend synchronization\n- Graphql introduction\n- MongoDB + Mongoose Introduction\n- Typegraphql introduction\n- Typegoose introduction\n- A Graphql Server with Apollo and Angular demo.\n",
      "link": "#",
      "speaker": {
        "avatar": "https://drive.google.com/file/d/1HFhwvWAp9EhouYA9sqLFapfz5MEB9Tsz/view?usp=sharing",
        "name": "DSC CityU - Eugene",
        "tag": "Web"
      }
   }
  ],
  "14:40": [
    {
      "time": "2020-10-10 14:40",
      "title": "DSC CityU: Deploy to Cloud! Using GCP to build a Kubernetes environment",
      "description": "Deploying to the cloud is one of the most important parts of nowadays business. No matter if you are a GCP, Azure, or AWS lover, using Kubernetes as your container orchestration software is definitely a future proof solution. This session is a beginner tech sharing that will demo how to deploy your project to the cloud.\n1. Starting from scratch\n2. Concept and architecture of K8s\n3. Dockerize your project\n4. Running image on pods\n5. Deploy to GCP Kubernetes Engine",
      "link": "#",
      "speaker": {
        "avatar": "https://drive.google.com/file/d/18Xl-ARCKAmLosYn4TmNF07ZV5iTjWYp7/view?usp=sharing",
        "name": "DSC CityU - Ryan",
        "tag": "Cloud"
      }
   }
  ],
  "15:20": [
    {
      "time": "2020-10-10 15:20",
      "title": "DSC HKU: Hollo’s startup journey with Google",
      "description": "Talk about how Hollo leverage Google tools such as G-suite, Tensorflow, etc at an early stage",
      "link": "#",
      "speaker": {
        "avatar": "",
        "name": "DSC HKU - Ajit Krishna",
        "tag": "Other"
      }
   }
  ],
  "16:00": [
    {
      "time": "2020-10-10 ",
      "title": "DSC HKU: Diving deep into javascript Promises",
      "description": "",
      "link": "#",
      "speaker": {
        "avatar": "",
        "name": "DSC HKU - Utkarsh Goel",
        "tag": "Web"
      }
   }
  ]
}